adoptopenjdk8
alfred
alt-tab
anki
anydesk
authy
azure-data-studio
brave-browser
breitbandmessung
clipy
dbngin
discord
disk-drill
docker
firefox
font-hack-nerd-font
gitkraken
google-chrome
google-cloud-sdk
google-drive
iterm2
lastpass
lens
logseq
mega
microsoft-teams
min
nordvpn
notion
nucleo
numi
openconnect-gui
openvpn-connect
pgadmin4
powershell
rectangle
slack
spotify
sublime-text
vagrant
visual-studio-code
wireshark
zoom
