adoptopenjdk8
alfred
anki
authy
brave-browser
breitbandmessung
clipy
dbngin
discord
docker
firefox
gitkraken
google-chrome
google-cloud-sdk
google-drive
iterm2
lastpass
microsoft-teams
notion
openconnect-gui
rectangle
slack
spotify
sublime-text
vagrant
virtualbox
visual-studio-code
